Pandas CRUD Operations - Python

1. Create: Creating Dataframe

1. Creating a DataFrame from a Dictationary

In [4]:
import pandas as pd
data = {
    "Name": ["Ansh", "Sahil", "Ram"],
    "Age": [21, 20, 41],
    "City": ["Moradabad", "New Delhi", "Chennai"]
}
df = pd.DataFrame(data)
print(df)

    Name  Age       City
0   Ansh   21  Moradabad
1  Sahil   20  New Delhi
2    Ram   41    Chennai

2. Creating a DataFrame from Lists

import pandas as pd

names = ["Akshit", "Uday", "Sam"]
ages = [25, 30, 35]
cities = ["Gurugram", "New Delhi", "Chicago"]

df = pd.DataFrame({
    "Name": names,
    "Age": ages,
    "City": cities
})

print(df)

3. Creating a DataFrame from a CSV File

In [12]:
import pandas as pd

df = pd.read_csv(r"C:\Users\VICTUS\OneDrive\Desktop\parent\Machine learning and data science\datasets\data_for_pandas_day16.csv")
print(df.head())

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

2. Read: Reading Dataframe

In [15]:
import pandas as pd

data = {"Name": ["Eve", "Jack", "Charlie", "Henry", "John"],
        "Age": [25, 30, 35, 40, 45],
        "City": ["NY", "LA", "SF", "Houston", "Seattle"]}
df = pd.DataFrame(data)

print(df.head(3))

print()

print(df.tail(2))

      Name  Age City
0      Eve   25   NY
1     Jack   30   LA
2  Charlie   35   SF

    Name  Age     City
3  Henry   40  Houston
4   John   45  Seattle

2. Exploring Columns of the dataset

In [18]:
print(df.columns)

Index(['Name', 'Age', 'City'], dtype='object')

3. Checking Data Types with dtype

In [21]:
print(df.dtypes)

Name    object
Age      int64
City    object
dtype: object

4. Generating Descriptive Statistics with describe()

In [24]:
print(df.describe())

             Age
count   5.000000
mean   35.000000
std     7.905694
min    25.000000
25%    30.000000
50%    35.000000
75%    40.000000
max    45.000000

3. Filtering Columns

In [27]:
print(df["Name"])

0        Eve
1       Jack
2    Charlie
3      Henry
4       John
Name: Name, dtype: object

4. Accessing Multiple columns

In [30]:
print(df[["Name", "City"]])

      Name     City
0      Eve       NY
1     Jack       LA
2  Charlie       SF
3    Henry  Houston
4     John  Seattle

5. Finding Unique Values in a Column

In [35]:
print(df["City"].unique())

['NY' 'LA' 'SF' 'Houston' 'Seattle']

6. Filtering Rows (Conditional Filtering)

In [38]:
print(df[df["Age"] > 30])

      Name  Age     City
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

7. Filtering with Multiple Conditions (AND/OR Logic)

In [43]:
print(df[(df["Age"] > 30) & (df["City"] == "SF")])
print()
print(df[(df["Age"] > 30) | (df["City"] == "LA")])

      Name  Age City
2  Charlie   35   SF

      Name  Age     City
1     Jack   30       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

8. Indexing in Pandas

In [46]:
print(df.iloc[0])

Name    Eve
Age      25
City     NY
Name: 0, dtype: object

9. Accessing Rows and Cells

In [49]:
print(df.iloc[0, 2])

NY

10. Slicing Rows

In [52]:
print(df.iloc[1:3])

      Name  Age City
1     Jack   30   LA
2  Charlie   35   SF

3. Update: Modifying Data in Pandas

In [69]:
import pandas as pd

data = {'Name': ['Eve', 'Jack', 'Charlie', 'Henry', 'John'],
        'Age': [25, 30, 35, 40, 45],
        'City': ['NY', 'LA', 'SF', 'Houston', 'Seattle']}
df = pd.DataFrame(data)
df

      Name  Age     City
0      Eve   25       NY
1     Jack   30       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

In [71]:
df.loc[df['Name'] == 'Jack', 'Age'] = 42

print(df)

      Name  Age     City
0      Eve   25       NY
1     Jack   42       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

In [73]:
df['City'] = ['Boston', 'Chicago', 'LA', 'Austin', 'Miami']
df

      Name  Age     City
0      Eve   25   Boston
1     Jack   42  Chicago
2  Charlie   35       LA
3    Henry   40   Austin
4     John   45    Miami

In [75]:
df.loc[df['City'] == 'LA', 'Age'] = 31
df

      Name  Age     City
0      Eve   25   Boston
1     Jack   42  Chicago
2  Charlie   31       LA
3    Henry   40   Austin
4     John   45    Miami

4. Delete: Removing Data in Pandas

In [78]:
import pandas as pd

data = {'Name': ['Eve', 'Jack', 'Charlie', 'Henry', 'John'],
        'Age': [25, 30, 35, 40, 45],
        'City': ['NY', 'LA', 'SF', 'Houston', 'Seattle']}
df = pd.DataFrame(data)

print(df)

      Name  Age     City
0      Eve   25       NY
1     Jack   30       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

In [80]:
df = df.drop('City', axis=1)
print(df)

      Name  Age
0      Eve   25
1     Jack   30
2  Charlie   35
3    Henry   40
4     John   45

In [82]:
df = df.drop(2, axis=0) 
print(df)

    Name  Age
0    Eve   25
1   Jack   30
3  Henry   40
4   John   45

In [86]:
df = df[df['Age'] == 25]
print(df)

  Name  Age
0  Eve   25

In [88]:
df = pd.DataFrame(data)

del df